espressif/esp-idf/components/soc/esp32c6/register/soc/lp_i2c_reg.h
/** LP_I2C_CLK_CONF_REG register
 *  I2C CLK configuration register
 */
#define LP_I2C_CLK_CONF_REG (DR_REG_LP_I2C_BASE + 0x54)
/** LP_I2C_SCLK_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  the integral part of the fractional divisor for i2c module
 */
#define LP_I2C_SCLK_DIV_NUM    0x000000FFU
#define LP_I2C_SCLK_DIV_NUM_M  (LP_I2C_SCLK_DIV_NUM_V << LP_I2C_SCLK_DIV_NUM_S)
#define LP_I2C_SCLK_DIV_NUM_V  0x000000FFU
#define LP_I2C_SCLK_DIV_NUM_S  0
/** LP_I2C_SCLK_DIV_A : R/W; bitpos: [13:8]; default: 0;
 *  the numerator of the fractional part of the fractional divisor for i2c module
 */
#define LP_I2C_SCLK_DIV_A    0x0000003FU
#define LP_I2C_SCLK_DIV_A_M  (LP_I2C_SCLK_DIV_A_V << LP_I2C_SCLK_DIV_A_S)
#define LP_I2C_SCLK_DIV_A_V  0x0000003FU
#define LP_I2C_SCLK_DIV_A_S  8
/** LP_I2C_SCLK_DIV_B : R/W; bitpos: [19:14]; default: 0;
 *  the denominator of the fractional part of the fractional divisor for i2c module
 */
#define LP_I2C_SCLK_DIV_B    0x0000003FU
#define LP_I2C_SCLK_DIV_B_M  (LP_I2C_SCLK_DIV_B_V << LP_I2C_SCLK_DIV_B_S)
#define LP_I2C_SCLK_DIV_B_V  0x0000003FU
#define LP_I2C_SCLK_DIV_B_S  14
/** LP_I2C_SCLK_SEL : R/W; bitpos: [20]; default: 0;
 *  The clock selection for i2c module:0-XTAL,1-CLK_8MHz.
 */
#define LP_I2C_SCLK_SEL    (BIT(20))
#define LP_I2C_SCLK_SEL_M  (LP_I2C_SCLK_SEL_V << LP_I2C_SCLK_SEL_S)
#define LP_I2C_SCLK_SEL_V  0x00000001U
#define LP_I2C_SCLK_SEL_S  20
/** LP_I2C_SCLK_ACTIVE : R/W; bitpos: [21]; default: 1;
 *  The clock switch for i2c module
 */
#define LP_I2C_SCLK_ACTIVE    (BIT(21))
#define LP_I2C_SCLK_ACTIVE_M  (LP_I2C_SCLK_ACTIVE_V << LP_I2C_SCLK_ACTIVE_S)
#define LP_I2C_SCLK_ACTIVE_V  0x00000001U
#define LP_I2C_SCLK_ACTIVE_S  21

/** LP_I2C_COMD0_REG register
 *  I2C command register 0
 */
#define LP_I2C_COMD0_REG (DR_REG_LP_I2C_BASE + 0x58)
/** LP_I2C_COMMAND0 : R/W; bitpos: [13:0]; default: 0;
 *  This is the content of command 0. It consists of three parts:
 *  op_code is the command, 6: RSTART, 1: WRITE, 3: READ, 2: STOP, 4: END.
 *  Byte_num represents the number of bytes that need to be sent or received.
 *  ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C cmd
 *  structure for more
 *  Information.
 */
#define LP_I2C_COMMAND0    0x00003FFFU
#define LP_I2C_COMMAND0_M  (LP_I2C_COMMAND0_V << LP_I2C_COMMAND0_S)
#define LP_I2C_COMMAND0_V  0x00003FFFU
#define LP_I2C_COMMAND0_S  0
/** LP_I2C_COMMAND0_DONE : R/W/SS; bitpos: [31]; default: 0;
 *  When command 0 is done in I2C Master mode, this bit changes to high
 *  level.
 */
#define LP_I2C_COMMAND0_DONE    (BIT(31))
#define LP_I2C_COMMAND0_DONE_M  (LP_I2C_COMMAND0_DONE_V << LP_I2C_COMMAND0_DONE_S)
#define LP_I2C_COMMAND0_DONE_V  0x00000001U
#define LP_I2C_COMMAND0_DONE_S  31

/** LP_I2C_COMD1_REG register
 *  I2C command register 1
 */
#define LP_I2C_COMD1_REG (DR_REG_LP_I2C_BASE + 0x5c)
/** LP_I2C_COMMAND1 : R/W; bitpos: [13:0]; default: 0;
 *  This is the content of command 1. It consists of three parts:
 *  op_code is the command, 6: RSTART, 1: WRITE, 3: READ, 2: STOP, 4: END.
 *  Byte_num represents the number of bytes that need to be sent or received.
 *  ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C cmd
 *  structure for more
 *  Information.
 */
#define LP_I2C_COMMAND1    0x00003FFFU
#define LP_I2C_COMMAND1_M  (LP_I2C_COMMAND1_V << LP_I2C_COMMAND1_S)
#define LP_I2C_COMMAND1_V  0x00003FFFU
#define LP_I2C_COMMAND1_S  0
/** LP_I2C_COMMAND1_DONE : R/W/SS; bitpos: [31]; default: 0;
 *  When command 1 is done in I2C Master mode, this bit changes to high
 *  level.
 */
#define LP_I2C_COMMAND1_DONE    (BIT(31))
#define LP_I2C_COMMAND1_DONE_M  (LP_I2C_COMMAND1_DONE_V << LP_I2C_COMMAND1_DONE_S)
#define LP_I2C_COMMAND1_DONE_V  0x00000001U
#define LP_I2C_COMMAND1_DONE_S  31

/** LP_I2C_COMD2_REG register
 *  I2C command register 2
 */
#define LP_I2C_COMD2_REG (DR_REG_LP_I2C_BASE + 0x60)
/** LP_I2C_COMMAND2 : R/W; bitpos: [13:0]; default: 0;
 *  This is the content of command 2. It consists of three parts:
 *  op_code is the command, 6: RSTART, 1: WRITE, 3: READ, 2: STOP, 4: END.
 *  Byte_num represents the number of bytes that need to be sent or received.
 *  ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C cmd
 *  structure for more
 *  Information.
 */
#define LP_I2C_COMMAND2    0x00003FFFU
#define LP_I2C_COMMAND2_M  (LP_I2C_COMMAND2_V << LP_I2C_COMMAND2_S)
#define LP_I2C_COMMAND2_V  0x00003FFFU
#define LP_I2C_COMMAND2_S  0
/** LP_I2C_COMMAND2_DONE : R/W/SS; bitpos: [31]; default: 0;
 *  When command 2 is done in I2C Master mode, this bit changes to high
 *  Level.
 */
#define LP_I2C_COMMAND2_DONE    (BIT(31))
#define LP_I2C_COMMAND2_DONE_M  (LP_I2C_COMMAND2_DONE_V << LP_I2C_COMMAND2_DONE_S)
#define LP_I2C_COMMAND2_DONE_V  0x00000001U
#define LP_I2C_COMMAND2_DONE_S  31

/** LP_I2C_COMD3_REG register
 *  I2C command register 3
 */
#define LP_I2C_COMD3_REG (DR_REG_LP_I2C_BASE + 0x64)
/** LP_I2C_COMMAND3 : R/W; bitpos: [13:0]; default: 0;
 *  This is the content of command 3. It consists of three parts:
 *  op_code is the command, 6: RSTART, 1: WRITE, 3: READ, 2: STOP, 4: END.
 *  Byte_num represents the number of bytes that need to be sent or received.
 *  ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C cmd
 *  structure for more
 *  Information.
 */
#define LP_I2C_COMMAND3    0x00003FFFU
#define LP_I2C_COMMAND3_M  (LP_I2C_COMMAND3_V << LP_I2C_COMMAND3_S)
#define LP_I2C_COMMAND3_V  0x00003FFFU
#define LP_I2C_COMMAND3_S  0
/** LP_I2C_COMMAND3_DONE : R/W/SS; bitpos: [31]; default: 0;
 *  When command 3 is done in I2C Master mode, this bit changes to high
 *  level.
 */
#define LP_I2C_COMMAND3_DONE    (BIT(31))
#define LP_I2C_COMMAND3_DONE_M  (LP_I2C_COMMAND3_DONE_V << LP_I2C_COMMAND3_DONE_S)
#define LP_I2C_COMMAND3_DONE_V  0x00000001U
#define LP_I2C_COMMAND3_DONE_S  31

/** LP_I2C_COMD4_REG register
 *  I2C command register 4
 */
#define LP_I2C_COMD4_REG (DR_REG_LP_I2C_BASE + 0x68)
/** LP_I2C_COMMAND4 : R/W; bitpos: [13:0]; default: 0;
 *  This is the content of command 4. It consists of three parts:
 *  op_code is the command, 6: RSTART, 1: WRITE, 3: READ, 2: STOP, 4: END.
 *  Byte_num represents the number of bytes that need to be sent or received.
 *  ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C cmd
 *  structure for more
 *  Information.
 */
#define LP_I2C_COMMAND4    0x00003FFFU
#define LP_I2C_COMMAND4_M  (LP_I2C_COMMAND4_V << LP_I2C_COMMAND4_S)
#define LP_I2C_COMMAND4_V  0x00003FFFU
#define LP_I2C_COMMAND4_S  0
/** LP_I2C_COMMAND4_DONE : R/W/SS; bitpos: [31]; default: 0;
 *  When command 4 is done in I2C Master mode, this bit changes to high
 *  level.
 */
#define LP_I2C_COMMAND4_DONE    (BIT(31))
#define LP_I2C_COMMAND4_DONE_M  (LP_I2C_COMMAND4_DONE_V << LP_I2C_COMMAND4_DONE_S)
#define LP_I2C_COMMAND4_DONE_V  0x00000001U
#define LP_I2C_COMMAND4_DONE_S  31

/** LP_I2C_COMD5_REG register
 *  I2C command register 5
 */
#define LP_I2C_COMD5_REG (DR_REG_LP_I2C_BASE + 0x6c)
/** LP_I2C_COMMAND5 : R/W; bitpos: [13:0]; default: 0;
 *  This is the content of command 5. It consists of three parts:
 *  op_code is the command, 6: RSTART, 1: WRITE, 3: READ, 2: STOP, 4: END.
 *  Byte_num represents the number of bytes that need to be sent or received.
 *  ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C cmd
 *  structure for more
 *  Information.
 */
#define LP_I2C_COMMAND5    0x00003FFFU
#define LP_I2C_COMMAND5_M  (LP_I2C_COMMAND5_V << LP_I2C_COMMAND5_S)
#define LP_I2C_COMMAND5_V  0x00003FFFU
#define LP_I2C_COMMAND5_S  0
/** LP_I2C_COMMAND5_DONE : R/W/SS; bitpos: [31]; default: 0;
 *  When command 5 is done in I2C Master mode, this bit changes to high level.
 */
#define LP_I2C_COMMAND5_DONE    (BIT(31))
#define LP_I2C_COMMAND5_DONE_M  (LP_I2C_COMMAND5_DONE_V << LP_I2C_COMMAND5_DONE_S)
#define LP_I2C_COMMAND5_DONE_V  0x00000001U
#define LP_I2C_COMMAND5_DONE_S  31

/** LP_I2C_COMD6_REG register
 *  I2C command register 6
 */
#define LP_I2C_COMD6_REG (DR_REG_LP_I2C_BASE + 0x70)
/** LP_I2C_COMMAND6 : R/W; bitpos: [13:0]; default: 0;
 *  This is the content of command 6. It consists of three parts:
 *  op_code is the command, 6: RSTART, 1: WRITE, 3: READ, 2: STOP, 4: END.
 *  Byte_num represents the number of bytes that need to be sent or received.
 *  ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C cmd
 *  structure for more
 *  Information.
 */
#define LP_I2C_COMMAND6    0x00003FFFU
#define LP_I2C_COMMAND6_M  (LP_I2C_COMMAND6_V << LP_I2C_COMMAND6_S)
#define LP_I2C_COMMAND6_V  0x00003FFFU
#define LP_I2C_COMMAND6_S  0
/** LP_I2C_COMMAND6_DONE : R/W/SS; bitpos: [31]; default: 0;
 *  When command 6 is done in I2C Master mode, this bit changes to high level.
 */
#define LP_I2C_COMMAND6_DONE    (BIT(31))
#define LP_I2C_COMMAND6_DONE_M  (LP_I2C_COMMAND6_DONE_V << LP_I2C_COMMAND6_DONE_S)
#define LP_I2C_COMMAND6_DONE_V  0x00000001U
#define LP_I2C_COMMAND6_DONE_S  31

/** LP_I2C_COMD7_REG register
 *  I2C command register 7
 */
#define LP_I2C_COMD7_REG (DR_REG_LP_I2C_BASE + 0x74)
/** LP_I2C_COMMAND7 : R/W; bitpos: [13:0]; default: 0;
 *  This is the content of command 7. It consists of three parts:
 *  op_code is the command, 6: RSTART, 1: WRITE, 3: READ, 2: STOP, 4: END.
 *  Byte_num represents the number of bytes that need to be sent or received.
 *  ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C cmd
 *  structure for more
 *  Information.
 */
#define LP_I2C_COMMAND7    0x00003FFFU
#define LP_I2C_COMMAND7_M  (LP_I2C_COMMAND7_V << LP_I2C_COMMAND7_S)
#define LP_I2C_COMMAND7_V  0x00003FFFU
#define LP_I2C_COMMAND7_S  0
/** LP_I2C_COMMAND7_DONE : R/W/SS; bitpos: [31]; default: 0;
 *  When command 7 is done in I2C Master mode, this bit changes to high level.
 */
#define LP_I2C_COMMAND7_DONE    (BIT(31))
#define LP_I2C_COMMAND7_DONE_M  (LP_I2C_COMMAND7_DONE_V << LP_I2C_COMMAND7_DONE_S)
#define LP_I2C_COMMAND7_DONE_V  0x00000001U
#define LP_I2C_COMMAND7_DONE_S  31

