espressif/esp-idf/components/soc/esp32c6/register/soc/lp_i2c_reg.h
/** LP_I2C_SCL_ST_TIME_OUT_REG register
 *  SCL status time out register
 */
#define LP_I2C_SCL_ST_TIME_OUT_REG (DR_REG_LP_I2C_BASE + 0x78)
/** LP_I2C_SCL_ST_TO_I2C : R/W; bitpos: [4:0]; default: 16;
 *  The threshold value of SCL_FSM state unchanged period. It should be o more than 23
 */
#define LP_I2C_SCL_ST_TO_I2C    0x0000001FU
#define LP_I2C_SCL_ST_TO_LP_I2C_M  (LP_I2C_SCL_ST_TO_LP_I2C_V << LP_I2C_SCL_ST_TO_LP_I2C_S)
#define LP_I2C_SCL_ST_TO_LP_I2C_V  0x0000001FU
#define LP_I2C_SCL_ST_TO_LP_I2C_S  0

/** LP_I2C_SCL_MAIN_ST_TIME_OUT_REG register
 *  SCL main status time out register
 */
#define LP_I2C_SCL_MAIN_ST_TIME_OUT_REG (DR_REG_LP_I2C_BASE + 0x7c)
/** LP_I2C_SCL_MAIN_ST_TO_I2C : R/W; bitpos: [4:0]; default: 16;
 *  The threshold value of SCL_MAIN_FSM state unchanged period.nIt should be o more
 *  than 23
 */
#define LP_I2C_SCL_MAIN_ST_TO_I2C    0x0000001FU
#define LP_I2C_SCL_MAIN_ST_TO_LP_I2C_M  (LP_I2C_SCL_MAIN_ST_TO_LP_I2C_V << LP_I2C_SCL_MAIN_ST_TO_LP_I2C_S)
#define LP_I2C_SCL_MAIN_ST_TO_LP_I2C_V  0x0000001FU
#define LP_I2C_SCL_MAIN_ST_TO_LP_I2C_S  0

/** LP_I2C_SCL_SP_CONF_REG register
 *  Power configuration register
 */
#define LP_I2C_SCL_SP_CONF_REG (DR_REG_LP_I2C_BASE + 0x80)
/** LP_I2C_SCL_RST_SLV_EN : R/W/SC; bitpos: [0]; default: 0;
 *  When I2C master is IDLE, set this bit to send out SCL pulses. The number of pulses
 *  equals to reg_scl_rst_slv_num[4:0].
 */
#define LP_I2C_SCL_RST_SLV_EN    (BIT(0))
#define LP_I2C_SCL_RST_SLV_EN_M  (LP_I2C_SCL_RST_SLV_EN_V << LP_I2C_SCL_RST_SLV_EN_S)
#define LP_I2C_SCL_RST_SLV_EN_V  0x00000001U
#define LP_I2C_SCL_RST_SLV_EN_S  0
/** LP_I2C_SCL_RST_SLV_NUM : R/W; bitpos: [5:1]; default: 0;
 *  Configure the pulses of SCL generated in I2C master mode. Valid when
 *  reg_scl_rst_slv_en is 1.
 */
#define LP_I2C_SCL_RST_SLV_NUM    0x0000001FU
#define LP_I2C_SCL_RST_SLV_NUM_M  (LP_I2C_SCL_RST_SLV_NUM_V << LP_I2C_SCL_RST_SLV_NUM_S)
#define LP_I2C_SCL_RST_SLV_NUM_V  0x0000001FU
#define LP_I2C_SCL_RST_SLV_NUM_S  1
/** LP_I2C_SCL_PD_EN : R/W; bitpos: [6]; default: 0;
 *  The power down enable bit for the I2C output SCL line. 1: Power down. 0: Not power
 *  down. Set reg_scl_force_out and reg_scl_pd_en to 1 to stretch SCL low.
 */
#define LP_I2C_SCL_PD_EN    (BIT(6))
#define LP_I2C_SCL_PD_EN_M  (LP_I2C_SCL_PD_EN_V << LP_I2C_SCL_PD_EN_S)
#define LP_I2C_SCL_PD_EN_V  0x00000001U
#define LP_I2C_SCL_PD_EN_S  6
/** LP_I2C_SDA_PD_EN : R/W; bitpos: [7]; default: 0;
 *  The power down enable bit for the I2C output SDA line. 1: Power down. 0: Not power
 *  down. Set reg_sda_force_out and reg_sda_pd_en to 1 to stretch SDA low.
 */
#define LP_I2C_SDA_PD_EN    (BIT(7))
#define LP_I2C_SDA_PD_EN_M  (LP_I2C_SDA_PD_EN_V << LP_I2C_SDA_PD_EN_S)
#define LP_I2C_SDA_PD_EN_V  0x00000001U
#define LP_I2C_SDA_PD_EN_S  7

/** LP_I2C_DATE_REG register
 *  Version register
 */
#define LP_I2C_DATE_REG (DR_REG_LP_I2C_BASE + 0xf8)
/** LP_I2C_DATE : R/W; bitpos: [31:0]; default: 35656003;
 *  This is the the version register.
 */
#define LP_I2C_DATE    0xFFFFFFFFU
#define LP_I2C_DATE_M  (LP_I2C_DATE_V << LP_I2C_DATE_S)
#define LP_I2C_DATE_V  0xFFFFFFFFU
#define LP_I2C_DATE_S  0

/** LP_I2C_TXFIFO_START_ADDR_REG register
 *  I2C TXFIFO base address register
 */
#define LP_I2C_TXFIFO_START_ADDR_REG (DR_REG_LP_I2C_BASE + 0x100)
/** LP_I2C_TXFIFO_START_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  This is the I2C txfifo first address.
 */
#define LP_I2C_TXFIFO_START_ADDR    0xFFFFFFFFU
#define LP_I2C_TXFIFO_START_ADDR_M  (LP_I2C_TXFIFO_START_ADDR_V << LP_I2C_TXFIFO_START_ADDR_S)
#define LP_I2C_TXFIFO_START_ADDR_V  0xFFFFFFFFU
#define LP_I2C_TXFIFO_START_ADDR_S  0

/** LP_I2C_RXFIFO_START_ADDR_REG register
 *  I2C RXFIFO base address register
 */
#define LP_I2C_RXFIFO_START_ADDR_REG (DR_REG_LP_I2C_BASE + 0x180)
/** LP_I2C_RXFIFO_START_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  This is the I2C rxfifo first address.
 */
#define LP_I2C_RXFIFO_START_ADDR    0xFFFFFFFFU
#define LP_I2C_RXFIFO_START_ADDR_M  (LP_I2C_RXFIFO_START_ADDR_V << LP_I2C_RXFIFO_START_ADDR_S)
#define LP_I2C_RXFIFO_START_ADDR_V  0xFFFFFFFFU
#define LP_I2C_RXFIFO_START_ADDR_S  0

#ifdef __cplusplus
}
#endif
